
import {Post} from "./Post";

export enum BlogType {
    Text, Podcast, Video
}

export class Blog {
    public name:string;
    public mediaUrl:string;
    public siteUrl:string;
    public blogSummary:string;
    public type:BlogType;
    public readers?:number;
    public posts:Post[];
}

export class Blogs {
    public static StartuPiko : Blog = {
        siteUrl:'http://he.startupiko.com/',
        name:'סטארטאפיקו',
        mediaUrl:'',
        type:BlogType.Text,
        blogSummary:'בלוג זה יתמקד בתרבות של חברות סטארטאפ ובעיקר כאלה בישראל. גיוס עובדים, ניהול צוותים, פרודקטיביות, יצירת DNA, גיוסי כספים, עבודה עם הצד השני של האוקיינוס ועוד. אני גם אשתף פה בתהליך הקמת הסטארטאפ החדש שלי וכל מה שמעניין בבניית חברה מאפס. הבלוג מיועד ליזמים, עובדים בחברות סטארטאפ וכל מי שחושב לעבוד באחת.',
        posts: [
            {
                title:'פוקוס. איך לדעת מה הדבר הנכון לעבוד עליו עכשיו.',
                summary:'אחת השאלות הכי מרתקות (ומפחידות) שכל יזם שואל את עצמו לא מעט היא "למה סטארטאפים נכשלים?". חוסר פוקוס היא ללא ספק אחת התשובות העיקריות. זו גם הסיבה שפרוייקטים נכשלים ושאנשים נכשלים בתפקידים שהם ממלאים.',
                publishDate:'28.01.2017',
                url:'http://he.startupiko.com/focus/'
            },
            {
                title:'למה החלטתי לוותר על (חלק) מהפינוקים בחברה אבל לתת לכל עובד 500 ש"ח בחודש לתרומה',
                summary:'יש המון חלקים מדהימים בתרבות של סטארטאפים שאני מנסה לשמר באוריבי. מצד שני, יש לא מעט אלמנטים מיושנים שמאפיינים את תרבות הסטארטאפים, שרידים לימי הבועה הראשונה, ומתקשרים לצד הראוותני והבזבזני ללא סיבה מוצדקת.',
                publishDate:'24.08.2016',
                url:'http://he.startupiko.com/donation/'
            },
            {
                title:'למה ביטלנו את ה Open space ושברנו את הקירות של חדר הישיבות?',
                summary:'אחת ההחלטות המשמעותיות ביצירת תרבות של חברה היא אופן חלוקת החלל במשרד. תכנון משרד הוא נושא שקרוב מאד לליבי, גם בגלל שלמדתי ארכיטקטורה אבל בעיקר כי ראיתי כמה השפעה יש לכך ואיך נוצרת תרבות שונה בעקבות חלל שונה.',
                publishDate:'02.08.2016',
                url:'http://he.startupiko.com/office/'
            },
            {
                title:'על חגיגות קטנות בסטארטאפ',
                summary:'פוסט קצר על החשיבות של חגיגות קטנות. זה לא חדש שסטארטאפ הוא רכבת הרים, וגם בחברות הכי מצליחות יש מורדות באופן תדיר. השאלה היא איך חווים את רכבת ההרים הזו, וזה לגמרי ביידים שלכם.',
                publishDate:'08.11.2015',
                url:'http://he.startupiko.com/celebration/'
            },
            {
                title:'Starting a startup – איך בחרתי במה להתמקד בסטארטאפ השלישי שלי?',
                summary:'בניגוד לפוסטים אחרים שלי בהם אני כותבת קצת בפרספקטיבה, החלטתי לעשות את המעשה האמיץ בבלוג הזה ולשתף את תהליך בניית הסטארטאפ כמעט בזמן אמת. אין זה מדריך, אלא הסיפור האישי שלי בהקמה של אוריבי – איך בחרתי איזה חברה ומוצר לבנות, האם לגייס כסף ואיך לבנות את התכנית לחודשים הקרובים.',
                publishDate:'02.11.2015',
                url:'http://he.startupiko.com/starting-a-startup/'
            }
        ]
    };

    public static Hashavua : Blog = {
        siteUrl:'http://www.shavua.net/',
        name:'השבוע',
        mediaUrl:'https://media.simplecast.com/podcast/logo_image/173/Website_20Header_202.png',
        blogSummary:'פודקאסאט שבועי על סטארטאפים בעברית. מאת דוד כץ ואיתן לויט.',
        type:BlogType.Podcast,
        posts: [
            {
                title:'ההצלחה של Wix עם אבישי אברהמי',
                summary:`דוד: “אתה הסתכלת על האינטרנט ואמרת שזה לא יכול להיות שזה כל כך מסובך לבנות אתר, ורציתם להציע את האפשרות לכל אחד להקים אתר אינטרנט. אבל לא רציתם להתחייב בדיוק לאיזה סוג אז ניסיתם הרבה אופציות של בניית אתרים פשוטה.”

אבישי: “הייתה לנו טכנולוגיה מגניבה - מה עושים איתה עכשיו? אז עשינו השקה לעשרה תחומים והסתכלנו על הדאטה, במה אנשים השתמשו - התשובה הייתה פרופילים למייספייס, כרטיסי ברכה ואתרים.”

איתן: “ובסוף הלכתם רק על האתרים?”

אבישי: “נכון. ומזל שבחרנו אתרים ולא עמודי מייספייס. זאת הייתה נקודה שיכלנו לעשות פיפס והחברה הייתה נעלמת.”`,
                url:'http://www.shavua.net/48'
            },
            {
                title:'מהירות',
                summary:`יש שני דברים חשובים בסטארטאפים: להחליט מה עושים ולעשות את זה טוב. חלק בלתי נפרד מההגדרה של לעשות דברים טוב זה לעשות אותם מהר מכיוון שקצב התקדמות של סטארטאפ הינו קריטי לקיומו. מהירות לא קשורה דווקא להיקף שעות העבודה- אלה לאיכות העבודה, על מה ואיך עובדים. בפרק נגענו בנקודות מהותיות שגורמות להאטה והאצה של הקצב.`,
                url:'http://www.shavua.net/307'
            },
            {
                title:'מהלכים חזקים',
                summary:'מהלך חזק זאת החלטה שמאחוריה תיאוריה שהמהלך יכול לייצר תוצאות חזקות. משהו שמשנה את המשחק ומזיז את המחט. אולי המהלך יגביר בצורה משמעותית את ההכנסות או את כמות השיתופים, אבל בכל מקרה התוצאה תהיה משמעותית אם המהלך יעבוד. אנחנו מאמינים שיש ערך חזק שנוצר לחברות שמתמקדות במהלכים חזקים, שיכולים לייצר תוצאות חזקות, ועל זה דיברנו בפרק.',
                url:'http://www.shavua.net/301'
            },
        ]
    };
}