
import {Post} from "./Post";

export enum BlogType {
    Text, Podcast, Video
}

export class Blog {
    public name:string;
    public mediaUrl:string;
    public siteUrl:string;
    public blogSummary:string;
    public type:BlogType;
    public readers?:number;
    public posts:Post[];
}

export class Blogs {
    public static StartuPiko : Blog = {
        siteUrl:'http://he.startupiko.com/',
        name:'סטארטאפיקו',
        mediaUrl:'',
        type:BlogType.Text,
        blogSummary:'בלוג זה יתמקד בתרבות של חברות סטארטאפ ובעיקר כאלה בישראל. גיוס עובדים, ניהול צוותים, פרודקטיביות, יצירת DNA, גיוסי כספים, עבודה עם הצד השני של האוקיינוס ועוד. אני גם אשתף פה בתהליך הקמת הסטארטאפ החדש שלי וכל מה שמעניין בבניית חברה מאפס. הבלוג מיועד ליזמים, עובדים בחברות סטארטאפ וכל מי שחושב לעבוד באחת.',
        posts: [
            {
                title:'פוקוס. איך לדעת מה הדבר הנכון לעבוד עליו עכשיו.',
                summary:'אחת השאלות הכי מרתקות (ומפחידות) שכל יזם שואל את עצמו לא מעט היא "למה סטארטאפים נכשלים?". חוסר פוקוס היא ללא ספק אחת התשובות העיקריות. זו גם הסיבה שפרוייקטים נכשלים ושאנשים נכשלים בתפקידים שהם ממלאים.',
                publishDate:'28.01.2017',
                url:'http://he.startupiko.com/focus/'
            },
            {
                title:'למה החלטתי לוותר על (חלק) מהפינוקים בחברה אבל לתת לכל עובד 500 ש"ח בחודש לתרומה',
                summary:'יש המון חלקים מדהימים בתרבות של סטארטאפים שאני מנסה לשמר באוריבי. מצד שני, יש לא מעט אלמנטים מיושנים שמאפיינים את תרבות הסטארטאפים, שרידים לימי הבועה הראשונה, ומתקשרים לצד הראוותני והבזבזני ללא סיבה מוצדקת.',
                publishDate:'24.08.2016',
                url:'http://he.startupiko.com/donation/'
            },
            {
                title:'למה ביטלנו את ה Open space ושברנו את הקירות של חדר הישיבות?',
                summary:'אחת ההחלטות המשמעותיות ביצירת תרבות של חברה היא אופן חלוקת החלל במשרד. תכנון משרד הוא נושא שקרוב מאד לליבי, גם בגלל שלמדתי ארכיטקטורה אבל בעיקר כי ראיתי כמה השפעה יש לכך ואיך נוצרת תרבות שונה בעקבות חלל שונה.',
                publishDate:'02.08.2016',
                url:'http://he.startupiko.com/office/'
            },
            {
                title:'על חגיגות קטנות בסטארטאפ',
                summary:'פוסט קצר על החשיבות של חגיגות קטנות. זה לא חדש שסטארטאפ הוא רכבת הרים, וגם בחברות הכי מצליחות יש מורדות באופן תדיר. השאלה היא איך חווים את רכבת ההרים הזו, וזה לגמרי ביידים שלכם.',
                publishDate:'08.11.2015',
                url:'http://he.startupiko.com/celebration/'
            },
            {
                title:'Starting a startup – איך בחרתי במה להתמקד בסטארטאפ השלישי שלי?',
                summary:'בניגוד לפוסטים אחרים שלי בהם אני כותבת קצת בפרספקטיבה, החלטתי לעשות את המעשה האמיץ בבלוג הזה ולשתף את תהליך בניית הסטארטאפ כמעט בזמן אמת. אין זה מדריך, אלא הסיפור האישי שלי בהקמה של אוריבי – איך בחרתי איזה חברה ומוצר לבנות, האם לגייס כסף ואיך לבנות את התכנית לחודשים הקרובים.',
                publishDate:'02.11.2015',
                url:'http://he.startupiko.com/starting-a-startup/'
            }
        ]
    };

    public static Hashavua : Blog = {
        siteUrl:'http://www.shavua.net/',
        name:'השבוע',
        mediaUrl:'https://media.simplecast.com/podcast/logo_image/173/Website_20Header_202.png',
        blogSummary:'פודקאסאט שבועי על סטארטאפים בעברית. מאת דוד כץ ואיתן לויט.',
        type:BlogType.Podcast,
        posts: [
            {
                title:'ההצלחה של Wix עם אבישי אברהמי',
                summary:`דוד: “אתה הסתכלת על האינטרנט ואמרת שזה לא יכול להיות שזה כל כך מסובך לבנות אתר, ורציתם להציע את האפשרות לכל אחד להקים אתר אינטרנט. אבל לא רציתם להתחייב בדיוק לאיזה סוג אז ניסיתם הרבה אופציות של בניית אתרים פשוטה.”

אבישי: “הייתה לנו טכנולוגיה מגניבה - מה עושים איתה עכשיו? אז עשינו השקה לעשרה תחומים והסתכלנו על הדאטה, במה אנשים השתמשו - התשובה הייתה פרופילים למייספייס, כרטיסי ברכה ואתרים.”

איתן: “ובסוף הלכתם רק על האתרים?”

אבישי: “נכון. ומזל שבחרנו אתרים ולא עמודי מייספייס. זאת הייתה נקודה שיכלנו לעשות פיפס והחברה הייתה נעלמת.”`,
                url:'http://www.shavua.net/48'
            },
            {
                title:'מהירות',
                summary:`יש שני דברים חשובים בסטארטאפים: להחליט מה עושים ולעשות את זה טוב. חלק בלתי נפרד מההגדרה של לעשות דברים טוב זה לעשות אותם מהר מכיוון שקצב התקדמות של סטארטאפ הינו קריטי לקיומו. מהירות לא קשורה דווקא להיקף שעות העבודה- אלה לאיכות העבודה, על מה ואיך עובדים. בפרק נגענו בנקודות מהותיות שגורמות להאטה והאצה של הקצב.`,
                url:'http://www.shavua.net/307'
            },
            {
                title:'מהלכים חזקים',
                summary:'מהלך חזק זאת החלטה שמאחוריה תיאוריה שהמהלך יכול לייצר תוצאות חזקות. משהו שמשנה את המשחק ומזיז את המחט. אולי המהלך יגביר בצורה משמעותית את ההכנסות או את כמות השיתופים, אבל בכל מקרה התוצאה תהיה משמעותית אם המהלך יעבוד. אנחנו מאמינים שיש ערך חזק שנוצר לחברות שמתמקדות במהלכים חזקים, שיכולים לייצר תוצאות חזקות, ועל זה דיברנו בפרק.',
                url:'http://www.shavua.net/301'
            },
            {
                title:'פרוייקטי צד',
                summary:`השבוע דיברנו על פרוייקטי צד. פרוייקט צד הוא פרוייקט שעושים מהצד, משהו שהוא לא העבודה הראשית שלנו, ומשהו שלא לוקח הרבה זמן.

הרבה מהמוצרים שאנחנו משתמשים בהם כל יום התחילו כפרוייקטי צד - נגיד פייסבוק, או ג׳ימייל. גם הפודקאסט שלנו הוא פרוייקט צד אגב. בפרק אנחנו מנסים להבין קצת את התופעה. למה פרוייקטי צד זה משהו שיותר ויותר אנשים וחברות עושות? למה זה טוב? למה דווקא מפרוייקטים כאלה לפעמים יוצאים דברים אדירים?`,
                url:'http://www.shavua.net/16'
            }
        ]
    };

    public static Hasolidit : Blog = {
        siteUrl:'https://www.hasolidit.com/',
        name:'הסולידית',
        mediaUrl:'http://www.hasolidit.com/wp-content/uploads/2014/04/SOLIDSMALL10.jpg',
        blogSummary:`הבלוג הזה עוסק בחופש. האתר מתיימר להציג מסגרת רעיונית ופרקטית שתאפשר לקוראיו לקחת אחריות אישית ולהגיע לעצמאות כלכלית בכוחות עצמם. בעולם חומרי וחומרני, חופש כלכלי הוא תמציתה של החירות.
    מה תעשו בחופש הזה? לא באמת משנה לי.`,
        type:BlogType.Text,
        posts: [
            {
                title:'3,873 ש"ח בחודש וחיה כמו מלכה – סיכום שנה',
                summary:`היום ה-31 בדצמבר – הגיעה העת לסכם את ההוצאות שלי בשנה החולפת.  
בחישוב כולל, במהלך שנת 2013 הוצאתי 46,474 ש"ח.

 
בסכום הזה הספקתי לטוס ל-3 ימים למרכז אירופה, לצאת לעשרות טיולי אופניים וטיולים רגליים בארץ, להשתתף בחוג אייקידו על בסיס שבועי, לדאוג לכלב שלי, להחזיק בלוג, לקנות לי קצת בגדים ומוצרי טיפוח, לגור בדירה חמודה שמתאימה לי, לשמור על כושר וגוף בריא, לאכול תפריט מאוזן, לישון טוב ולהגיע ממקום למקום ביעילות ובזול.`,
                url:'https://www.hasolidit.com/3873-%D7%A9%D7%97-%D7%91%D7%97%D7%95%D7%93%D7%A9-%D7%95%D7%97%D7%99%D7%94-%D7%9B%D7%9E%D7%95-%D7%9E%D7%9C%D7%9B%D7%94-%D7%A1%D7%99%D7%9B%D7%95%D7%9D-%D7%A9%D7%A0%D7%94'
            },
            {
                title:'הבהלה לברלין — הטוב, הרע והמגוחך',
                summary:`בסוציולוגיה ובפילוסופיה, המונח סוכנות (Agency) מתייחס למידת יכולתו של אדם לפעול באופן עצמאי, כזה שאינו עולה בקנה אחד עם תכתיבי החברה. לעומת זאת, המונח "מבנה" (Structure) מתייחס לכל אותם משתנים מערכתיים שמגבילים לכאורה את מידת יכולתו של הפרט להשפיע על חייו ולשלוט בגורלו.
אדם מפתח סוכנות כשהוא מאמין שסיכויי ההצלחה שלו משתפרים ככל שהוא משקיע מאמץ רב יותר (גם אם לא ניתן לחזות את העתיד).`,
                url:'https://www.hasolidit.com/%D7%94%D7%91%D7%94%D7%9C%D7%94-%D7%9C%D7%91%D7%A8%D7%9C%D7%99%D7%9F-%D7%94%D7%98%D7%95%D7%91-%D7%94%D7%A8%D7%A2-%D7%95%D7%94%D7%9E%D7%92%D7%95%D7%97%D7%9A'
            },
            {
                title:'כך תשקיעו בזול',
                summary:`אתם אף פעם לא לבד כשאתם משקיעים בבורסה.
ככל זירה שמגלגלת כסף גדול, שוק ההון מלא "שותפים סמויים" שינסו בכל דרך לנגוס בתשואת תיק ההשקעות שלכם כאילו היו מכרסם רצחני ואחוז תזזית.
השותפות הזו, מטבעה, אינה שיוויונית: כולם מתחלקים בכסף שלכם, אבל רק אתם נושאים בסיכון.  

 
ישנם שלושה "שותפים" מרכזיים שחשוב להכיר:`,
                url:'https://www.hasolidit.com/%D7%9B%D7%9A-%D7%AA%D7%A9%D7%A7%D7%99%D7%A2%D7%95-%D7%91%D7%96%D7%95%D7%9C'
            },
            {
                title:'מכוניתך או חייך?',
                summary:`מבין כל ההחלטות הפיננסיות שאדם יכול לקבל, ההחלטה הדרמטית ביותר (במונחים של מיידיות ההשפעה על מצבו הכלכלי) היא ויתור על אמצעי תחבורה ששורפים כסף וצוברים שומן, והחלפתם בכאלה ששורפים שומן וחוסכים כסף.
היכולת לנוע ממקום למקום בחופשיות היא מרכיב בסיסי בחירותו של אדם, וככזו היא צורך אנושי בסיסי. לרוע המזל, רבים מבלבלים בין הצורך הזה לבין התשוקה להתנייד באמצעות רכב פרטי — מותרות יקרה מאין כמותה.
לפי הערכת חברת חשב, בשנת 2013 שילם הישראלי הממוצע 33,121 ש"ח עבור אחזקת רכב פרטי טיפוסי (משומש, מנוע 1.6 ל') שגמא נסוּעה ממוצעת (15,000 ק"מ). הנתון הזה — הכולל הוצאות בגין ירידת ערך, ריבית, אגרות רישוי, טיפולים, דלק וחלקי חילוף — משקף עלות נסיעה כוללת של 2.21 ש"ח לקילומטר.`,
                url:'https://www.hasolidit.com/%D7%9E%D7%9B%D7%95%D7%A0%D7%99%D7%AA%D7%9A-%D7%90%D7%95-%D7%97%D7%99%D7%99%D7%9A'
            }
        ]
    };

    public static ChayotKis : Blog = {
        siteUrl:'http://www.kan.org.il/Podcast/program.aspx/?progId=7',
        name:'חיות כיס',
        mediaUrl:'http://www.kan.org.il/download/pictures/podcastProgram7_img_share.jpg',
        blogSummary:`ישיבת המערכת עם שאול אמסטרדמסקי, צליל אברהם ואנשי הדסק הכלכלי של "כאן" - מהאותיות הקטנות ועד לכוחות הכי חזקים במשק`,
        type:BlogType.Podcast,
        posts: [
            {
                title:'כסף בחינם!',
                summary:`מה אם הממשלה הייתה משלמת לאזרחים משכורת קבועה כל חודש, בלי שהם יצטרכו לעבוד, ובלי שהם יצטרכו לעשות שום דבר אחר בתמורה. ליותר ויותר אנשים הרעיון הזה כבר לא נשמע כמו מדע בדיוני `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=6136'
            },
            {
                title:'וירוסים ממאדים וחיידקים מנוגה',
                summary:`לפעמים נדמה שאנטיביוטיקה היא התשובה לכל, אבל לפי מחקרים, עד שנת 2050 שימוש יתר יגרום למוות של 10 מיליון אנשים בשנה. לשני חבר'ה עם שני מקררים יש רעיון איך לשנות את זה `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=6152'
            },
            {
                title:'כשהחיים נותנים לימונים',
                summary:`הפרדוקס המשונה של תעשיית הביטוח, ויזם אחד שמנסה לעשות מהפכה בעולם האפרורי הזה `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=5120'
            },
            {
                title:'להציל את הרוח הישראלית',
                summary:`ב-30 השנים האחרונות חלה ירידה דרמטית במספר הסטודנטים בפקולטות למדעי הרוח, והחוגים גוססים. פרופ' שמעון שוקן, דווקא איש מדעי המחשב, יוצא לקרב מאסף להצלת עם הספר - אך האם צריך לעשות זאת בכל מחיר? `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=38'
            },
            {
                title:'הפסיכולוגיה של הכסף, הכסף של הפסיכולוגיה',
                summary:`מהו המטבע המקומי של פלורנטין, על מה באמת נאבקים הפסיכולוגים, ואיך שר האוצר מתכוון לגרום לכולנו להלוות לעצמנו את הכסף שלנו - ושמישהו אחר יגזור על זה קופון `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=31'
            }
        ]
    };
}