
import {Post} from "./Post";

export enum BlogType {
    Text, Podcast, Video
}

export class Blog {
    public name:string;
    public mediaUrl:string;
    public siteUrl:string;
    public blogSummary:string;
    public type:BlogType;
    public readers?:number;
    public posts:Post[];
}

export class Blogs {
    public static StartuPiko : Blog = {
        siteUrl:'http://he.startupiko.com/',
        name:'סטארטאפיקו',
        mediaUrl:'',
        type:BlogType.Text,
        blogSummary:'בלוג זה יתמקד בתרבות של חברות סטארטאפ ובעיקר כאלה בישראל. גיוס עובדים, ניהול צוותים, פרודקטיביות, יצירת DNA, גיוסי כספים, עבודה עם הצד השני של האוקיינוס ועוד. אני גם אשתף פה בתהליך הקמת הסטארטאפ החדש שלי וכל מה שמעניין בבניית חברה מאפס. הבלוג מיועד ליזמים, עובדים בחברות סטארטאפ וכל מי שחושב לעבוד באחת.',
        posts: [
            {
                title:'פוקוס. איך לדעת מה הדבר הנכון לעבוד עליו עכשיו.',
                summary:'אחת השאלות הכי מרתקות (ומפחידות) שכל יזם שואל את עצמו לא מעט היא "למה סטארטאפים נכשלים?". חוסר פוקוס היא ללא ספק אחת התשובות העיקריות. זו גם הסיבה שפרוייקטים נכשלים ושאנשים נכשלים בתפקידים שהם ממלאים.',
                publishDate:'28.01.2017',
                url:'http://he.startupiko.com/focus/'
            },
            {
                title:'למה החלטתי לוותר על (חלק) מהפינוקים בחברה אבל לתת לכל עובד 500 ש"ח בחודש לתרומה',
                summary:'יש המון חלקים מדהימים בתרבות של סטארטאפים שאני מנסה לשמר באוריבי. מצד שני, יש לא מעט אלמנטים מיושנים שמאפיינים את תרבות הסטארטאפים, שרידים לימי הבועה הראשונה, ומתקשרים לצד הראוותני והבזבזני ללא סיבה מוצדקת.',
                publishDate:'24.08.2016',
                url:'http://he.startupiko.com/donation/'
            },
            {
                title:'למה ביטלנו את ה Open space ושברנו את הקירות של חדר הישיבות?',
                summary:'אחת ההחלטות המשמעותיות ביצירת תרבות של חברה היא אופן חלוקת החלל במשרד. תכנון משרד הוא נושא שקרוב מאד לליבי, גם בגלל שלמדתי ארכיטקטורה אבל בעיקר כי ראיתי כמה השפעה יש לכך ואיך נוצרת תרבות שונה בעקבות חלל שונה.',
                publishDate:'02.08.2016',
                url:'http://he.startupiko.com/office/'
            },
            {
                title:'על חגיגות קטנות בסטארטאפ',
                summary:'פוסט קצר על החשיבות של חגיגות קטנות. זה לא חדש שסטארטאפ הוא רכבת הרים, וגם בחברות הכי מצליחות יש מורדות באופן תדיר. השאלה היא איך חווים את רכבת ההרים הזו, וזה לגמרי ביידים שלכם.',
                publishDate:'08.11.2015',
                url:'http://he.startupiko.com/celebration/'
            },
            {
                title:'Starting a startup – איך בחרתי במה להתמקד בסטארטאפ השלישי שלי?',
                summary:'בניגוד לפוסטים אחרים שלי בהם אני כותבת קצת בפרספקטיבה, החלטתי לעשות את המעשה האמיץ בבלוג הזה ולשתף את תהליך בניית הסטארטאפ כמעט בזמן אמת. אין זה מדריך, אלא הסיפור האישי שלי בהקמה של אוריבי – איך בחרתי איזה חברה ומוצר לבנות, האם לגייס כסף ואיך לבנות את התכנית לחודשים הקרובים.',
                publishDate:'02.11.2015',
                url:'http://he.startupiko.com/starting-a-startup/'
            }
        ]
    };

    public static Hashavua : Blog = {
        siteUrl:'http://www.shavua.net/',
        name:'השבוע',
        mediaUrl:'https://media.simplecast.com/podcast/logo_image/173/Website_20Header_202.png',
        blogSummary:'פודקאסאט שבועי על סטארטאפים בעברית. מאת דוד כץ ואיתן לויט.',
        type:BlogType.Podcast,
        posts: [
            {
                title:'ההצלחה של Wix עם אבישי אברהמי',
                summary:`דוד: “אתה הסתכלת על האינטרנט ואמרת שזה לא יכול להיות שזה כל כך מסובך לבנות אתר, ורציתם להציע את האפשרות לכל אחד להקים אתר אינטרנט. אבל לא רציתם להתחייב בדיוק לאיזה סוג אז ניסיתם הרבה אופציות של בניית אתרים פשוטה.”

אבישי: “הייתה לנו טכנולוגיה מגניבה - מה עושים איתה עכשיו? אז עשינו השקה לעשרה תחומים והסתכלנו על הדאטה, במה אנשים השתמשו - התשובה הייתה פרופילים למייספייס, כרטיסי ברכה ואתרים.”

איתן: “ובסוף הלכתם רק על האתרים?”

אבישי: “נכון. ומזל שבחרנו אתרים ולא עמודי מייספייס. זאת הייתה נקודה שיכלנו לעשות פיפס והחברה הייתה נעלמת.”`,
                url:'http://www.shavua.net/48'
            },
            {
                title:'מהירות',
                summary:`יש שני דברים חשובים בסטארטאפים: להחליט מה עושים ולעשות את זה טוב. חלק בלתי נפרד מההגדרה של לעשות דברים טוב זה לעשות אותם מהר מכיוון שקצב התקדמות של סטארטאפ הינו קריטי לקיומו. מהירות לא קשורה דווקא להיקף שעות העבודה- אלה לאיכות העבודה, על מה ואיך עובדים. בפרק נגענו בנקודות מהותיות שגורמות להאטה והאצה של הקצב.`,
                url:'http://www.shavua.net/307'
            },
            {
                title:'מהלכים חזקים',
                summary:'מהלך חזק זאת החלטה שמאחוריה תיאוריה שהמהלך יכול לייצר תוצאות חזקות. משהו שמשנה את המשחק ומזיז את המחט. אולי המהלך יגביר בצורה משמעותית את ההכנסות או את כמות השיתופים, אבל בכל מקרה התוצאה תהיה משמעותית אם המהלך יעבוד. אנחנו מאמינים שיש ערך חזק שנוצר לחברות שמתמקדות במהלכים חזקים, שיכולים לייצר תוצאות חזקות, ועל זה דיברנו בפרק.',
                url:'http://www.shavua.net/301'
            },
            {
                title:'פרוייקטי צד',
                summary:`השבוע דיברנו על פרוייקטי צד. פרוייקט צד הוא פרוייקט שעושים מהצד, משהו שהוא לא העבודה הראשית שלנו, ומשהו שלא לוקח הרבה זמן.

הרבה מהמוצרים שאנחנו משתמשים בהם כל יום התחילו כפרוייקטי צד - נגיד פייסבוק, או ג׳ימייל. גם הפודקאסט שלנו הוא פרוייקט צד אגב. בפרק אנחנו מנסים להבין קצת את התופעה. למה פרוייקטי צד זה משהו שיותר ויותר אנשים וחברות עושות? למה זה טוב? למה דווקא מפרוייקטים כאלה לפעמים יוצאים דברים אדירים?`,
                url:'http://www.shavua.net/16'
            }
        ]
    };

    public static Hasolidit : Blog = {
        siteUrl:'https://www.hasolidit.com/',
        name:'הסולידית',
        mediaUrl:'http://www.hasolidit.com/wp-content/uploads/2014/04/SOLIDSMALL10.jpg',
        blogSummary:`הבלוג הזה עוסק בחופש. האתר מתיימר להציג מסגרת רעיונית ופרקטית שתאפשר לקוראיו לקחת אחריות אישית ולהגיע לעצמאות כלכלית בכוחות עצמם. בעולם חומרי וחומרני, חופש כלכלי הוא תמציתה של החירות.
    מה תעשו בחופש הזה? לא באמת משנה לי.`,
        type:BlogType.Text,
        posts: [
            {
                title:'3,873 ש"ח בחודש וחיה כמו מלכה – סיכום שנה',
                summary:`היום ה-31 בדצמבר – הגיעה העת לסכם את ההוצאות שלי בשנה החולפת.  
בחישוב כולל, במהלך שנת 2013 הוצאתי 46,474 ש"ח.

 
בסכום הזה הספקתי לטוס ל-3 ימים למרכז אירופה, לצאת לעשרות טיולי אופניים וטיולים רגליים בארץ, להשתתף בחוג אייקידו על בסיס שבועי, לדאוג לכלב שלי, להחזיק בלוג, לקנות לי קצת בגדים ומוצרי טיפוח, לגור בדירה חמודה שמתאימה לי, לשמור על כושר וגוף בריא, לאכול תפריט מאוזן, לישון טוב ולהגיע ממקום למקום ביעילות ובזול.`,
                url:'https://www.hasolidit.com/3873-%D7%A9%D7%97-%D7%91%D7%97%D7%95%D7%93%D7%A9-%D7%95%D7%97%D7%99%D7%94-%D7%9B%D7%9E%D7%95-%D7%9E%D7%9C%D7%9B%D7%94-%D7%A1%D7%99%D7%9B%D7%95%D7%9D-%D7%A9%D7%A0%D7%94'
            },
            {
                title:'הבהלה לברלין — הטוב, הרע והמגוחך',
                summary:`בסוציולוגיה ובפילוסופיה, המונח סוכנות (Agency) מתייחס למידת יכולתו של אדם לפעול באופן עצמאי, כזה שאינו עולה בקנה אחד עם תכתיבי החברה. לעומת זאת, המונח "מבנה" (Structure) מתייחס לכל אותם משתנים מערכתיים שמגבילים לכאורה את מידת יכולתו של הפרט להשפיע על חייו ולשלוט בגורלו.
אדם מפתח סוכנות כשהוא מאמין שסיכויי ההצלחה שלו משתפרים ככל שהוא משקיע מאמץ רב יותר (גם אם לא ניתן לחזות את העתיד).`,
                url:'https://www.hasolidit.com/%D7%94%D7%91%D7%94%D7%9C%D7%94-%D7%9C%D7%91%D7%A8%D7%9C%D7%99%D7%9F-%D7%94%D7%98%D7%95%D7%91-%D7%94%D7%A8%D7%A2-%D7%95%D7%94%D7%9E%D7%92%D7%95%D7%97%D7%9A'
            },
            {
                title:'כך תשקיעו בזול',
                summary:`אתם אף פעם לא לבד כשאתם משקיעים בבורסה.
ככל זירה שמגלגלת כסף גדול, שוק ההון מלא "שותפים סמויים" שינסו בכל דרך לנגוס בתשואת תיק ההשקעות שלכם כאילו היו מכרסם רצחני ואחוז תזזית.
השותפות הזו, מטבעה, אינה שיוויונית: כולם מתחלקים בכסף שלכם, אבל רק אתם נושאים בסיכון.  

 
ישנם שלושה "שותפים" מרכזיים שחשוב להכיר:`,
                url:'https://www.hasolidit.com/%D7%9B%D7%9A-%D7%AA%D7%A9%D7%A7%D7%99%D7%A2%D7%95-%D7%91%D7%96%D7%95%D7%9C'
            },
            {
                title:'מכוניתך או חייך?',
                summary:`מבין כל ההחלטות הפיננסיות שאדם יכול לקבל, ההחלטה הדרמטית ביותר (במונחים של מיידיות ההשפעה על מצבו הכלכלי) היא ויתור על אמצעי תחבורה ששורפים כסף וצוברים שומן, והחלפתם בכאלה ששורפים שומן וחוסכים כסף.
היכולת לנוע ממקום למקום בחופשיות היא מרכיב בסיסי בחירותו של אדם, וככזו היא צורך אנושי בסיסי. לרוע המזל, רבים מבלבלים בין הצורך הזה לבין התשוקה להתנייד באמצעות רכב פרטי — מותרות יקרה מאין כמותה.
לפי הערכת חברת חשב, בשנת 2013 שילם הישראלי הממוצע 33,121 ש"ח עבור אחזקת רכב פרטי טיפוסי (משומש, מנוע 1.6 ל') שגמא נסוּעה ממוצעת (15,000 ק"מ). הנתון הזה — הכולל הוצאות בגין ירידת ערך, ריבית, אגרות רישוי, טיפולים, דלק וחלקי חילוף — משקף עלות נסיעה כוללת של 2.21 ש"ח לקילומטר.`,
                url:'https://www.hasolidit.com/%D7%9E%D7%9B%D7%95%D7%A0%D7%99%D7%AA%D7%9A-%D7%90%D7%95-%D7%97%D7%99%D7%99%D7%9A'
            }
        ]
    };

    public static ChayotKis : Blog = {
        siteUrl:'http://www.kan.org.il/Podcast/program.aspx/?progId=7',
        name:'חיות כיס',
        mediaUrl:'http://www.kan.org.il/download/pictures/podcastProgram7_img_share.jpg',
        blogSummary:`ישיבת המערכת עם שאול אמסטרדמסקי, צליל אברהם ואנשי הדסק הכלכלי של "כאן" - מהאותיות הקטנות ועד לכוחות הכי חזקים במשק`,
        type:BlogType.Podcast,
        posts: [
            {
                title:'כסף בחינם!',
                summary:`מה אם הממשלה הייתה משלמת לאזרחים משכורת קבועה כל חודש, בלי שהם יצטרכו לעבוד, ובלי שהם יצטרכו לעשות שום דבר אחר בתמורה. ליותר ויותר אנשים הרעיון הזה כבר לא נשמע כמו מדע בדיוני `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=6136'
            },
            {
                title:'וירוסים ממאדים וחיידקים מנוגה',
                summary:`לפעמים נדמה שאנטיביוטיקה היא התשובה לכל, אבל לפי מחקרים, עד שנת 2050 שימוש יתר יגרום למוות של 10 מיליון אנשים בשנה. לשני חבר'ה עם שני מקררים יש רעיון איך לשנות את זה `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=6152'
            },
            {
                title:'כשהחיים נותנים לימונים',
                summary:`הפרדוקס המשונה של תעשיית הביטוח, ויזם אחד שמנסה לעשות מהפכה בעולם האפרורי הזה `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=5120'
            },
            {
                title:'להציל את הרוח הישראלית',
                summary:`ב-30 השנים האחרונות חלה ירידה דרמטית במספר הסטודנטים בפקולטות למדעי הרוח, והחוגים גוססים. פרופ' שמעון שוקן, דווקא איש מדעי המחשב, יוצא לקרב מאסף להצלת עם הספר - אך האם צריך לעשות זאת בכל מחיר? `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=38'
            },
            {
                title:'הפסיכולוגיה של הכסף, הכסף של הפסיכולוגיה',
                summary:`מהו המטבע המקומי של פלורנטין, על מה באמת נאבקים הפסיכולוגים, ואיך שר האוצר מתכוון לגרום לכולנו להלוות לעצמנו את הכסף שלנו - ושמישהו אחר יגזור על זה קופון `,
                url:'http://www.kan.org.il/Podcast/item.aspx?pid=31'
            }
        ]
    };

    public static Mamony : Blog = {
        siteUrl:'http://www.mamony.com/',
        name:'ממוני - השכלה פיננסית',
        mediaUrl:'http://www.mamony.com/wp-content/uploads/2017/01/Mamony-logoo@2x.png',
        blogSummary:`ממוני – השכלה פיננסית

חסכון פנסיוני? משכנתא מהבנק?הלוואות? השקעות? מניות? נשמע לי מוכר אבל בתכלס אני לא מבין בזה כלום!

חלקנו אם לא רובנו לא קיבלנו השכלה פיננסית.. לא בבית, לא בבית הספר ואף לא באוניברסיטה!

אז איך אנחנו אמורים לדעת איך לנהל את הכסף שלנו?
זה שאנחנו עובדים כל כך קשה בשביל להשיגו!
זה שאנחנו מנסים כל כך לחסוך בו ולעשות את הבחירות הכי נכונות שאנחנו יכולים למענו!

"ממוני" קם כדי לנסות לתת מענה לשאלות האלו, ועל הדרך לספר את הסיפור שלי והדרך שלי לעצמאות פיננסית.`,
        type:BlogType.Text,
        posts: [
            {
                title:`שווי הכסף, ערך הזמן ו"אפקט הלאטה"`,
                summary:`קשה לנו לוותר על דברים שאנחנו רוצים.

קשה לנו לחשוב במונחים של עוד עשר שנים (או יותר), ריבית דריבית, חיסכון גדל.

ובכלל קשה לנו לוותר היום בשביל המחר.

אנחנו בכלל לא מודעים איך הכסף שלנו היום יכול להצטבר.

מה אם הייתי אומר לכם שאם תפסיקו לשתות קפה בבית קפה תוכלו לטייל עם המשפחה מסביב לעולם?

זה נשמע כמו משהו שהייתם רוצים?

 

בפוסט הזה נדבר בכל זאת על החשבון (הפשוט יחסית) ועל הפרקטיקה של שווי הכסף וערך הזמן.

למי שלא קרא, כדאי קודם לקרוא קצת על ההבדל בין משהו שאנחנו רוצים לכזה שאנחנו צריכים.`,
                url:'http://www.mamony.com/%D7%A9%D7%95%D7%95%D7%99-%D7%94%D7%9B%D7%A1%D7%A3-%D7%A2%D7%A8%D7%9A-%D7%94%D7%96%D7%9E%D7%9F-%D7%95%D7%90%D7%A4%D7%A7%D7%98-%D7%94%D7%9C%D7%90%D7%98%D7%94/'
            },
            {
                title:'דואגים לעתיד – קרן פנסיה, קרן השתלמות, ביטוח מנהלים וביטוחים פנסיונים',
                summary:`לטוב או לרע, אנו מחויבים לחסוך לפנסיה. אותה תקופה בה לא נעבוד בעוד המון זמן (כיום גיל 67 לגברים ו62 לנשים).

אנחנו בודקים בסופר כמה עולה קילו עגבניות או איזה מותג טחינה הוא זול יותר, אך אנחנו לא מקפידים לבדוק מה קורה עם אותם הכספים (ששווים לנו הרבה, הרבה, הרבה יותר!)  והאם אנחנו יכולים לייעל ולהפיק יותר?`,
                url:'http://www.mamony.com/%D7%93%D7%95%D7%90%D7%92%D7%99%D7%9D-%D7%9C%D7%A2%D7%AA%D7%99%D7%93-%D7%A4%D7%A0%D7%A1%D7%99%D7%94-%D7%94%D7%A9%D7%AA%D7%9C%D7%9E%D7%95%D7%AA-%D7%91%D7%99%D7%98%D7%95%D7%97-%D7%9E%D7%A0%D7%94%D7%9C/'
            },
            {
                title:'למה הבית שלנו הוא לא נכס?',
                summary:`החלום הישראלי הוא לקנות בית.

כל יום יש כתבות בכל עיתון שמכבד את עצמו על איך הצעירים של היום לא יכולים להרשות לעצמם לקנות דירה.

להחלטה האם לקנות דירה או לא יש שני אספקטים: פסיכולוגי וכלכלי.

אני לא אעמיק באספקט הפסיכולוגי – את הבית שלנו אפשר לשפץ איך שרוצים, בית משלנו נותן לנו ביטחון ותמיד יש לאן לחזור.

 

אבל מה אם זאת לא החלטה כלכלית נכונה?

 

לפני שנרד לעומק, כדאי להבין באופן כללי מהו נכס.`,
                url:'http://www.mamony.com/%D7%9C%D7%9E%D7%94-%D7%94%D7%91%D7%99%D7%AA-%D7%A9%D7%9C%D7%A0%D7%95-%D7%94%D7%95%D7%90-%D7%9C%D7%90-%D7%A0%D7%9B%D7%A1/'
            },
            {
                title:'לקנות או לא לקנות? ההבדל שבין רצונות לצרכים',
                summary:`גם לכם תמיד זה קורה? מגיע אליכם סכום כסף (בין אם ממשכורת, מההורים, מאיזה בונוס או קרן השתלמות) וישר המחשבות רצות למה אפשר לקנות עם הסכום?

כבר הרבה זמן אני רוצה את האייפון החדש, או טלוויזיה לחדר השינה, או איזה בגד חדש, שלא לדבר על כמה זמן אני רוצה כבר לטוס לחופשה!

כאשר התהליך הזה קורה לנו, והוא קורה לכולנו, משתחרר בראש הורמון שגורם לתחושה זהה לתחושה שאנחנו מרגישים כשאנחנו רעבים, ממש לפני האוכל.

התהליך הזה משתכלל כל שנה ע"י החברות שמוכרות לנו "חלומות", יש שיכנו אותו בתור "תרבות העוד".

תמיד נרצה עוד. עוד יותר חדש, עוד יותר יפה, עוד יותר גדול.

 

אבל האם פעם עצרנו לחשוב?`,
                url:'http://www.mamony.com/%D7%9C%D7%A7%D7%A0%D7%95%D7%AA-%D7%90%D7%95-%D7%9C%D7%90-%D7%9C%D7%A7%D7%A0%D7%95%D7%AA-%D7%94%D7%94%D7%91%D7%93%D7%9C-%D7%91%D7%99%D7%9F-%D7%A8%D7%A6%D7%95%D7%9F-%D7%9C%D7%A6%D7%95%D7%A8%D7%9A/'
            },
            {
                title:'מדדים – השקעה חכמה במניות',
                summary:`השקעה בבורסה הוכחה כאחת ההשקעות הכי מוצלחות לאורך זמן (כמובן אם לא עושים טעויות גדולות לאורך הדרך).

 

וורן באפט (המשקיע הכי מוצלח ועשיר בהיסטוריה) אמר פעם על השקעה במניות –

"אתה לא צריך לבדוק את מחירי המניות שלך כל שבוע או כל חודש או אפילו כל שנה. אם יש לכם תיק השקעות שבו יש חתך רוחב של הסקטור העסקי באמריקה, ואתם לא מתלהבים ורוכשים בשיא בלבד, ואם אתם מבצעים את הרכישות לאורך זמן, מובטח לכם כי תעשו רווח".`,
                url:'http://www.mamony.com/%D7%9E%D7%93%D7%93%D7%99%D7%9D-%D7%94%D7%A9%D7%A7%D7%A2%D7%94-%D7%97%D7%9B%D7%9E%D7%94-%D7%91%D7%9E%D7%A0%D7%99%D7%95%D7%AA/'
            }
        ]
    };

    public static Startuping : Blog = {
        siteUrl:'http://www.startuping.co.il/',
        name:'Startuping',
        mediaUrl:'',
        blogSummary:`אני יזם אינטרנט, יועץ, מלווה ומעורב בסטארטאפים קטנים וגדולים. שבגדול אוהב לבנות דברים שפותרים כאבים למיליוני יוזרים בעולם. אני אוהב לבנות מוצרים מצוינים עם אנשים מצוינים וכיפים.

קראתי לבלוג Startuping כי אני מאמין שהקמת סטארטאפ זה תהליך מתמשך Present progressive, ואני נמצא עכשיו ממש בתהליך של לבנות את הדבר הבא.

למה בעברית?

כי אני מרגיש ששוק היזמות והיזמים בארץ בשל לידע מקצועי ואיכותי בעברית. בלוגים באנגלית יש כבר מיליון, הגיע הזמן שיהיה לנו כמה גם בעברית. אני מאמין שיש לי כמה דברים לתרום ולשתף שיכולים לעזור ליזמים להתמקצע עוד קצת.`,
        type:BlogType.Text,
        posts: [
            {
                title:'18 הטעויות שהורגות סטארטאפים – אמ:לק עצות לסטארטאפים של פול גראהם',
                summary:`פול גראהם הוא מתכנת, כותב, ומשקיע. כך הוא מגדיר את עצמו בדף הביו שלו באתר. האמת שפול גראהם הוא אחד המשקיעים האגדיים בסיליקון וואלי, וממקימי תוכנית האקסלרסציה YC. החל מ 2011 פול כותב מאמרים שהפכו לאבן יסוד בעולם הסטארטאפים. מדי פעם נפרסם תרגומים לעיקרי הטיפים שלו לסטארטאפים. כמובן שאני ממליץ בחום לקרוא את המאמרים המלאים.`,
                url:'http://www.startuping.co.il/18-mistakes-that-kill-startups/'
            },
            {
                title:'137 + קבוצות פייסבוק שכל יזם סטארטאפ צריך להכיר',
                summary:`עם מעל 1 מיליארד יוזרים פעילים בקבוצות פייסבוק מדי יום, קבוצות פייסבוק הפכו לכלי מרכזי וחיוני בארגז הכלים של יזם הסטארטאפ הישראלי. בקבוצות הפייסבוק השונות ניתן למצוא מענה רחב לצרכים של היזם, החל ממציאת שותפים, דרך שאלות ותשובות מיזמים מנוסים וכלה בגיוס עובדים ועזרה מקצועית בעיצוב ושיווק.

בפוסט הקודם למדנו איך אנחנו יכולים לחפש באופן מקצועי קבוצות בפייסבוק – המדריך המלא

בפוסט הזה עשיתי את כל העבודה הקשה בשבילכם וריכזתי מעל 137 קבוצות פייסבוק פופולריות שכדאי לכל יזם בישראל להכיר!`,
                url:'http://www.startuping.co.il/facebook-groups-for-entrepreneurs/'
            },
            {
                title:'משקיעים ממאדים יזמים מנגה – כל מה שחשוב ליזם לדעת לפני פגישת משקיעים',
                summary:`חשבתם על רעיון מעולה לסטארטאפ, כבר בניתם לו תוכנית עסקית, והחלטתם להפגש בקרוב עם משקיעים ולנסות לשכנע אותם להשקיע בכם ובמיזם שלכם. 
אבל האם עצרתם לרגע לשאול את עצמכם מה בכלל משקיעים מחפשים? מה מעניין אותם? מה חשוב להם? ומה חשוב להם לזהות בכם היזמים?`,
                url:'http://www.startuping.co.il/what-are-investors-looking-for/'
            },
            {
                title:'7 קלישאות יזמות שכל יזם צריך להכיר ומה שאפשר ללמוד מהן',
                summary:`בעולם הסטארטאפים ישנם מספר משלים מפורסמים שמשקיעים ויזמים משתמשים בהם שוב ושוב ושעוזרים להמחיש רעיון או נקודה מסוימת. בפוסט הזה קיבצתי 7 אמירות מפורסמות כאלה שנתקלתי בהן כיזם או שמצאתי את עצמי משתמש בהן כדי לבאר רעיון  מסויים ליזמים שאני פוגש.`,
                url:'http://www.startuping.co.il/7-startup-cliche/'
            },
            {
                title:'איך לבצע מחקר שוק לסטארטאפ – המדריך המלא',
                summary:`בין אם אתם סטארטאפ שמכין תכנית עסקית, עובד על מצגת למשקיעים או שאתם אחרי גיוס ועובדים על תכנית השיווק שלכם, מחקר שוק הוא אחד הדברים הכי חשובים שאתם יכולים לעשות. 
באמצעות מחקר שוק תוכלו לענות על שאלות רבות שנוגעות למהות העסק שאתם בונים ותקבלו תשובות על הפוטנציאל של הרעיון שלכם כמו גם על אסטרטגיית השיווק שלכם. מחקר שוק שמבוצע נכון יאפשר לכם לענות על שאלות קריטיות בבניית העסק כגון:
האם השוק גדול מספיק? האם הוא מעניין? מי השחקנים המרכזיים בשוק ומי המתחרים? מה הם עושים נכון ומה לא? מהו המודל העסקי הנפוץ בשוק? מהן מילות המפתח החשובות? מהם צרכי הלקוחות (מה הם תכל'ס מחפשים)? מה מקורות התנועה של המתחרים? איפה הם מפרסמים? איך נראות המודעות שלהם? ועוד ועוד…`,
                url:'http://www.startuping.co.il/competitors-research/'
            }
        ]
    };
}

